danhil/copter/PIC32/Quadcopter.X/source/main.cpp
    //All Pin configurations should start here 
    RPA0Rbits.RPA0R=5;                      //Sets RPA0 (pin 2) as OC1 (PWM1)
    RPA1Rbits.RPA1R=5;                      //Sets RPA1 (pin 3) as OC2 (PWM2)
    RPB0Rbits.RPB0R=5;                      //Sets RPB0 (pin 4) as OC3 (PWM3)
    RPB1Rbits.RPB1R=5;                      //Sets RPB1 (pin 5) as OC4 (PWM4)    
    RPB4Rbits.RPB4R=1;                      //Sets RPB4 (pin 11) as U1TX (UART TX)
    U1RXRbits.U1RXR=2;                      //Sets RPA4 (pin 12) as U1RX (UART RX)
    //All Pin configuration should end here

    SYSKEY = 0;                                   // Locks the pin Configurations

    //End of Peripheral Pin Select

    // Variable declarations
    UINT8               i2cData[10];
    I2C_7_BIT_ADDRESS   SlaveAddress;
    int                 Index;
    int                 DataSz;
    UINT32              actualClock;
    BOOL                Acknowledged;
    BOOL                Success = TRUE;
    UINT8               i2cbyte;

    unsigned int        count = 0;          // loop variable

    float AccX, AccY, AccZ;
    float GyroX, GyroY, GyroZ;
    float AngleY = 0;

    char DebugStr[12];
    int i;
    char CR[2] = {13,'\0'};
    char LF[2] = {10,'\0'};

    UINT8 kh_test;
    char filename[55];                         //Array of 50 chars
    //memset(filename,0,55*sizeof(char));         //Clears the Array
    //sprintf(filename, "Tutorial 4 ? UART Communication\nIncrementing Variable\n");    //Places the String into the Array

    // End of Variable declarations


    //INTEnableSystemMultiVectoredInt();      // Enable system wide interrupt to
                                            // multivectored mode.


    // Configure the Output Compare channels for PWM mode using Timer3
    // setup output compare channel #1 - RD0
    //OpenOC1(OC_OFF | OC_TIMER_MODE16 | OC_TIMER3_SRC | OC_PWM_FAULT_PIN_DISABLE, 0,0);
    //OpenOC2(OC_OFF | OC_TIMER_MODE16 | OC_TIMER3_SRC | OC_PWM_FAULT_PIN_DISABLE, 0,0);
    //OpenOC3(OC_OFF | OC_TIMER_MODE16 | OC_TIMER3_SRC | OC_PWM_FAULT_PIN_DISABLE, 0,0);
    //OpenOC4(OC_OFF | OC_TIMER_MODE16 | OC_TIMER3_SRC | OC_PWM_FAULT_PIN_DISABLE, 0,0);
    

    // Configure Timer3 interrupt. Note that in PWM mode, the
    // corresponding source timer interrupt flag is asserted.
    // OC interrupt is not generated in PWM mode.

    // Interrupt setup for Timer2 (should work for PIC32MX250)
    //IFS0CLR = 0x00000200;           // Clear the T2 interrupt flag
    //IEC0SET = 0x00000200;           // Enable T2 interrupt
    //IPC2SET = 0x0000001C;           // Set T2 interrupt priority to 7

    // Interrupt setup for Timer3
    //IFS0CLR = 0x00004000;           // Clear the T3 interrupt flag
    //IEC0SET = 0x00004000;           // Enable T3 interrupt
    //IPC3SET = 0x0000001C;           // Set T3 interrupt priority to 7
    
    // Configure Timer3
    // Timer3 generates 20ms period for PWM
    //OpenTimer3(T3_ON | T3_PS_1_8, PWM_PERIOD);

    //OC1CONSET = 0x8000;             // Enable OC1
    //OC2CONSET = 0x8000;             // Enable OC2
    //OC3CONSET = 0x8000;             // Enable OC3
    //OC4CONSET = 0x8000;             // Enable OC4


    // Configure UART1
    //UARTConfigure(UART1, UART_ENABLE_PINS_TX_RX_ONLY);
    //UARTSetLineControl(UART1, UART_DATA_SIZE_8_BITS | UART_PARITY_NONE | UART_STOP_BITS_1);
    //UARTSetLineControl(UART1, 0 | UART_PARITY_NONE | UART_STOP_BITS_1);

    //UARTSetDataRate(UART1, GetPeripheralClock(), UARTBaudRate);
    //UARTEnable(UART1, UART_ENABLE_FLAGS(UART_PERIPHERAL | UART_RX | UART_TX));

    //Initilize UART1
    OpenUART1(UART_EN|UART_BRGH_FOUR, UART_RX_ENABLE | UART_TX_ENABLE, GetPeripheralClock() / (4 * UARTBaudRate) - 1);
    //END UART1 Initialization 


	
    // Initialize 2 outputs used for debugging
    mPORTBClearBits(BIT_2);
    mPORTBSetPinsDigitalOut(BIT_2);

    mPORTBClearBits(BIT_3);
    mPORTBSetPinsDigitalOut(BIT_3);

    // i2c communication is not working if this delay is removed. 
    // The loop time may very well be shortened (not tested).
    // The MPU6050 probably need some time to initialized after power on.
    count = 0;
    while( count < 4000000 )
    {
        count++;
    }

    sprintf(filename, "Debug interface via UART/USB started.\n");
    putsUART1( filename );

/*
    // Set the I2C baudrate
    actualClock = I2CSetFrequency(MPU6050_I2C_BUS, GetPeripheralClock(), I2C_CLOCK_FREQ);
    if ( abs(actualClock-I2C_CLOCK_FREQ) > I2C_CLOCK_FREQ/10 )
    {        
        //putsUART1( "Error: I2C1 clock frequency. Error exceeds 10%%.\n" );
    }

    // Enable the I2C bus
    I2CEnable(MPU6050_I2C_BUS, TRUE);

*/
    //MPU6050 MPU6050dev(MPU6050_I2C_BUS, MPU6050_ADDRESS);
    MPU6050 MPU6050dev;

    kh_test = MPU6050dev.MPU6050_Test_I2C();

    sprintf(filename, "I2C address: %d\n", kh_test );
    putsUART1( filename );

    //fastnar i setup-funktionen. felsök denna funktion m.h.a PORTB bit2/3.
    MPU6050dev.Setup_MPU6050();    

    MPU6050dev.Calibrate_Gyros();
    

    //mPORTBSetBits(BIT_2);


    sprintf(filename, "\n\n\nMPU6050 Setup completed!\n\n\n");
    putsUART1( filename );

    count = 0;
    while(1)
    {  
        // Doing nothing...

        while (count)
        {
            count--;
        }

        //kh_test = i2c_read(0x75);

        //mPORTBSetBits(BIT_3);

        

        
/*
        if( kh_test != 0x68 )
        {
            putsUART1( "Address is not 0x68  \0" );
        }
        else
        {
            putsUART1( "BAddress is 0x68  \0" );
        }
*/
        /*i = 0;
        while(i < 55 )
        {
            putcUART1(filename[i]);      //Sends the Array over UART1
            i = i + 1;
        }*/

        //mPORTBToggleBits(BIT_2);

              
        

        MPU6050dev.Get_Accel_Values();
        //MPU6050dev.Get_Accel_Angles();

        MPU6050dev.Get_Gyro_Rates();

        //value = MPU6050dev.GetAngle();

        AccX = MPU6050dev.GetAccX();
        AccY = MPU6050dev.GetAccY();
        AccZ = MPU6050dev.GetAccZ();

        GyroX = MPU6050dev.GetGyroX();
        GyroY = MPU6050dev.GetGyroY();	// 177	// ska inte vara 177 längre. Har ändra skalningen så att GyroY ska vara grader/s
        GyroZ = MPU6050dev.GetGyroZ();

        //AccY = ( -AccX + 800 ) / 177;		// 177 	// 93.6
        AccY = ( -AccX );

        AngleY = (0.98)*(AngleY + GyroY/117) + (0.02)*( (AccY * 90) + 5.7 );	// Loopen går i ca 117 Hz

        //kh_test = MPU6050dev.MPU6050_Test_I2C();
        //sprintf(filename, "Angle: %f\n", AccX );
        //putsUART1( filename );

