danhil/copter/PIC32/Quadcopter.X/source/main.cpp
        kh_test = MPU6050dev.MPU6050_Test_I2C();

        sprintf(filename, "I2C address: %d\n", kh_test );
        putsUART1( filename );


        /*while(U1STAbits.URXDA)
        {
            getsUART1(50, filename, 123);       //Receives up to 50 characters from UART 1 and stores it in ?filename? array
            U1STAbits.URXDA =0;                 //Clears the URXDA bit so the UART continues to receive
            U1STAbits.OERR = 0;                 //Clears the OERR bit so UART clears buffer and receives new characters
            putsUART1(filename);                //send the buffer, filename, over UART1
            putsUART1("Hej");
            memset(filename,0,50*sizeof(char)); //Clears the buffer
            mPORTBToggleBits(BIT_2);
        }*/



        

        count = 4000000;
    }
    return (EXIT_SUCCESS);
}

char* itoa( INT16 nr, char *string )
{	
    //char string[6];
    INT16 nr2;
	
    char index = 0;
    char size = 0;

    if (nr == 0) // deals with the special case of convertng a 0.
    {
        string[ index++ ] = '0';
    }
    else if (nr < 0) // if negative number, add negative sign in string and remove negative sign in the number
    {
        string[ index++ ] = '-';
        nr = -nr;
    }

    nr2 = nr;

    while (nr2 > 0)
    {
        nr2 /= 10;
        size++;
    }

    string[ index + size ] = '\0';
    index = size - 1;

    while (size > 0)
    {
        string[ index-- ] = nr % 10 + 48;
        nr /= 10;
        size--;
    }

    string[ index ] = '\0';

    return string;
}
/*
// Timer3 ISR
void __ISR(_TIMER_3_VECTOR, ipl7) T3_IntHandler (void)
{
    //mPORTAToggleBits(BIT_1);

    if (forward)
    {
        Set_pwm(pwm_signal);
        Set_pwm2(pwm_signal);
        Set_pwm3(pwm_signal);
        Set_pwm4(pwm_signal);

        pwm_signal++;

        if (pwm_signal >= 100)
        {
            forward = 0;
        }
    }
    else
    {
        Set_pwm(pwm_signal);
        Set_pwm2(pwm_signal);
        Set_pwm3(pwm_signal);
        Set_pwm4(pwm_signal);

        pwm_signal--;

        if (pwm_signal <= 0)
        {
            forward = 1;
        }
    }
    IFS0CLR = 0x4000;                   // Clearing Timer3 interrupt flag
}
*/
/*******************************************************************************
  Function:
    BOOL StartTransfer( BOOL restart )

  Summary:
    Starts (or restarts) a transfer to/from the EEPROM.

  Description:
    This routine starts (or restarts) a transfer to/from the EEPROM, waiting (in
    a blocking loop) until the start (or re-start) condition has completed.

  Precondition:
    The I2C module must have been initialized.

  Parameters:
    restart - If FALSE, send a "Start" condition
            - If TRUE, send a "Restart" condition
    
  Returns:
    TRUE    - If successful
    FALSE   - If a collision occured during Start signaling
    
  Example:
    <code>
    StartTransfer(FALSE);
    </code>
 
  *****************************************************************************/

BOOL StartTransfer( BOOL restart )
{
    I2C_STATUS  status;
    UINT8 count = 0;

    // Send the Start (or Restart) signal
    if(restart)
    {
        I2CRepeatStart(MPU6050_I2C_BUS);
    }
    else
    {
        // Wait for the bus to be idle, then start the transfer
        //while( !I2CBusIsIdle(MPU6050_I2C_BUS) );

        // Checks if the bus is idle, and starts the transfer if so
        if( I2CBusIsIdle(MPU6050_I2C_BUS) )
        {
            if(I2CStart(MPU6050_I2C_BUS) != I2C_SUCCESS)
            {
                //DBPRINTF("Error: Bus collision during transfer Start\n");
                return FALSE;
            }
        }
        else
            return FALSE;
    }

    // Wait for the signal to complete or until time out
    do
    {
        status = I2CGetStatus(MPU6050_I2C_BUS);
        count++;

    } while ( !(status & I2C_START) && count < 200);

    if( count >= 200 )
        return FALSE;

    return TRUE;
}


/*******************************************************************************
  Function:
    BOOL TransmitOneByte( UINT8 data )

  Summary:
    This transmits one byte to the EEPROM.

  Description:
    This transmits one byte to the EEPROM, and reports errors for any bus
    collisions.

  Precondition:
    The transfer must have been previously started.

  Parameters:
    data    - Data byte to transmit

  Returns:
    TRUE    - Data was sent successfully
    FALSE   - A bus collision occured

  Example:
    <code>
    TransmitOneByte(0xAA);
    </code>
  
  *****************************************************************************/

BOOL TransmitOneByte( UINT8 data )
{
    UINT16 count = 0;

    // Wait for the transmitter to be ready
    while( !I2CTransmitterIsReady(MPU6050_I2C_BUS) && count < 64000 )
    {
        count++;
    }

    if( I2CTransmitterIsReady(MPU6050_I2C_BUS) )
    {
        // Transmit the byte
        if(I2CSendByte(MPU6050_I2C_BUS, data) == I2C_MASTER_BUS_COLLISION)
        {
            //DBPRINTF("Error: I2C Master Bus Collision\n");
            return FALSE;
        }

        // Wait for the transmission to finish
        while( !I2CTransmissionHasCompleted(MPU6050_I2C_BUS) && count < 5000 )
        {
            count++;
        }

        if( count >= 5000 )
            return FALSE;
    }
    else
        return FALSE;

    return TRUE;
}


/*******************************************************************************
  Function:
    void StopTransfer( void )

  Summary:
    Stops a transfer to/from the EEPROM.

  Description:
    This routine Stops a transfer to/from the EEPROM, waiting (in a 
    blocking loop) until the Stop condition has completed.

  Precondition:
    The I2C module must have been initialized & a transfer started.

  Parameters:
    None.
    
  Returns:
    None.
    
  Example:
    <code>
    StopTransfer();
    </code>
 
  *****************************************************************************/

void StopTransfer( void )
{
    I2C_STATUS  status;
    UINT8 count = 0;

