danhil/copter/PIC32/Quadcopter.X/source/main.cpp
    // Send the Stop signal
    I2CStop(MPU6050_I2C_BUS);

    // Wait for the signal to complete
    do
    {
        status = I2CGetStatus(MPU6050_I2C_BUS);
        count++;

    } while ( !(status & I2C_STOP) && count < 200);
}

/*******************************************************************************
  Function:
    UINT8 i2c_read( UINT8 regAddress )

  Description:
    Reads a register in the i2c device.

  Precondition:
    The I2C module must have been initialized.

  Parameters:
    8-bit address for the register to read.

  Returns:
    Content of the register that was read.

  *****************************************************************************/

UINT8 i2c_read( UINT8 regAddress )
{
    // Variable declarations
    UINT8               i2cData[10];
    I2C_7_BIT_ADDRESS   SlaveAddress;
    int                 Index;
    int                 DataSz;    
    BOOL                Acknowledged;
    BOOL                Success = TRUE;
    UINT8               i2cbyte;


    // Initialize the data buffer
    I2C_FORMAT_7_BIT_ADDRESS(SlaveAddress, MPU6050_ADDRESS, I2C_WRITE);
    i2cData[0] = SlaveAddress.byte;
    i2cData[1] = regAddress;                 // MPU6050 data address to read (0x75 = WHO_AM_I which contains 0x68)
    DataSz = 2;


    // Start the transfer
    if( !StartTransfer(FALSE) )
    {
        //while(1);
        Success = FALSE;
    }

    // Address the device.
    Index = 0;
    while( Success & (Index < DataSz) )
    {
        // Transmit a byte
        if (TransmitOneByte(i2cData[Index]))
            Index++;
        else
            Success = FALSE;

        // Verify that the byte was acknowledged
        if(!I2CByteWasAcknowledged(MPU6050_I2C_BUS))
        {
            //DBPRINTF("Error: Sent byte was not acknowledged\n");
            Success = FALSE;
        }
    }

    // Restart and send the device's internal address to switch to a read transfer
    if(Success)
    {
        // Send a Repeated Started condition
        if( !StartTransfer(TRUE) )
        {
            //while(1);
            Success = FALSE;
        }

        // Transmit the address with the READ bit set
        I2C_FORMAT_7_BIT_ADDRESS(SlaveAddress, MPU6050_ADDRESS, I2C_READ);
        if (TransmitOneByte(SlaveAddress.byte))
        {
            // Verify that the byte was acknowledged
            if(!I2CByteWasAcknowledged(MPU6050_I2C_BUS))
            {
                //DBPRINTF("Error: Sent byte was not acknowledged\n");
                Success = FALSE;
            }
        }
        else
        {
            Success = FALSE;
        }
    }

    i2cbyte = 9;

    // Read the data from the desired address
    if(Success)
    {
        if(I2CReceiverEnable(MPU6050_I2C_BUS, TRUE) == I2C_RECEIVE_OVERFLOW)
        {
            //DBPRINTF("Error: I2C Receive Overflow\n");
            Success = FALSE;
        }
        else
        {
            while(!I2CReceivedDataIsAvailable(MPU6050_I2C_BUS));
            i2cbyte = I2CGetByte(MPU6050_I2C_BUS);
        }
    }

    // End the transfer
    StopTransfer();
    if(!Success)
    {
        //while(1);

        //mPORTBSetBits(BIT_2);
        //mPORTBClearBits(BIT_3);
    }
/*
    if( i2cbyte == 0x68 )
    {
        mPORTBSetBits(BIT_2);
        mPORTBSetBits(BIT_3);
    }
    if( i2cbyte == 9 )
    {
        //mPORTBSetBits(BIT_2);
        //mPORTBClearBits(BIT_3);
    }
*/
    return i2cbyte;
}

BOOL i2c_write(UINT8 regAddress, UINT8 data)
{
    UINT8               i2cData[10];
    I2C_7_BIT_ADDRESS   SlaveAddress;
    int                 Index;
    int                 DataSz;
    BOOL                Acknowledged = FALSE;
    BOOL                Success = TRUE;
    
    // Initialize the data buffer
    I2C_FORMAT_7_BIT_ADDRESS(SlaveAddress, MPU6050_ADDRESS, I2C_WRITE);
    i2cData[0] = SlaveAddress.byte;
    i2cData[1] = regAddress;        // Register Address to write
    i2cData[3] = data;              // Data to write
    DataSz = 3;

    // Start the transfer
    if( !StartTransfer(FALSE) )
    {
        //while(1);
        Success = FALSE;
    }

    // Transmit all data
    Index = 0;
    while( Success && (Index < DataSz) )
    {
        // Transmit a byte
        if (TransmitOneByte(i2cData[Index]))
        {
            // Advance to the next byte
            Index++;

            // Verify that the byte was acknowledged
            if(!I2CByteWasAcknowledged(MPU6050_I2C_BUS))
            {
                //DBPRINTF("Error: Sent byte was not acknowledged\n");
                Success = FALSE;
            }
        }
        else
        {
            Success = FALSE;
        }
    }

    // End the transfer
    StopTransfer();
    
    // Wait for device to complete write process, by polling the ack status.    
    while (Acknowledged != TRUE && Success != FALSE);
    {
        // Start the transfer
        if( StartTransfer(FALSE) )
        {  
            // Transmit just the device's address
            if (TransmitOneByte(SlaveAddress.byte))
            {
                // Check to see if the byte was acknowledged
                Acknowledged = I2CByteWasAcknowledged(MPU6050_I2C_BUS);
            }
            else           
                Success = FALSE;            

            // End the transfer
            StopTransfer();
        }
        else
          Success = FALSE;
    }
    return Success;
}


void Serial_print(char *buffer)
{
   while(*buffer != (char)0)
   {
      while(!UARTTransmitterIsReady(UART1));
      UARTSendDataByte(UART1, *buffer++);
   }
    while(!UARTTransmissionHasCompleted(UART1));
   UARTSendDataByte(UART1, '\r');
   UARTSendDataByte(UART1, '\n');
}